УТ_для_edt/src/Catalogs/CRM_ПричиныОтказаПоИнтересам/CRM_ПричиныОтказаПоИнтересам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПричиныОтказаПоИнтересам</name>
  <comment>Причины завершения интересов и обращений</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Выполнено</name>
      <description>Выполнено</description>
    </items>
    <items>
      <name>ЗаявкаАннулирована</name>
      <description>Заявка аннулирована</description>
    </items>
    <items>
      <name>ОшибочнаяЗаявка</name>
      <description>Ошибочная заявка</description>
    </items>
    <items>
      <name>ПовторныйВыезд</name>
      <description>Повторный выезд</description>
    </items>
    <items>
      <name>ТребуетсяПовторныйВыезд</name>
      <description>Требуется повторный выезд</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ПричиныОтказаПоИнтересам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура СоздатьЭлементыПоУмолчанию() Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не удается связаться';en='Unable to connect'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не одобрило руководство';en='It is not approved by Management'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Выбрал конкурента';en='Chose competitor'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нужна была только консультация';en='Need only consultation'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроила цена';en='Not satisfied with the price'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроило качество обслуживания';en='Not satisfied with quality of service'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Не устроило качество продукции';en='Not satisfied with quality of products'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нецелевой клиент';en='Untargeted Customer'");
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru='Нет денег';en='No money'");
	НовыйЭлемент.Записать();
	
КонецПроцедуры

Функция ОписаниеКомандЗавершения(ТипОбращения, Сценарий) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("Наименование");
	Результат.Колонки.Добавить("ИмяКоманды");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка КАК Ссылка,
	|	ПричиныЗавершения.Наименование КАК Наименование
	|ПОМЕСТИТЬ ДоступныеПричины
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = &ТипОбращения
	|	И ПричиныЗавершения.Сценарий = &Сценарий
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = &ТипОбращения
	|	И ПричиныЗавершения.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
	|	И ПричиныЗавершения.Сценарий = &Сценарий
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПричиныЗавершения.Ссылка,
	|	ПричиныЗавершения.Наименование
	|ИЗ
	|	Справочник.CRM_ПричиныОтказаПоИнтересам КАК ПричиныЗавершения
	|ГДЕ
	|	НЕ ПричиныЗавершения.ПометкаУдаления
	|	И ПричиныЗавершения.ТипОбращения = ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.ПустаяСсылка)
	|	И ПричиныЗавершения.Сценарий = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|	И НЕ ПричиныЗавершения.ЭтоГруппа
	|	И ПричиныЗавершения.ОтображатьПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеПричины.Ссылка КАК Ссылка,
	|	ДоступныеПричины.Наименование КАК Наименование
	|ИЗ
	|	ДоступныеПричины КАК ДоступныеПричины
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоступныеПричины.Наименование");
	
	Запрос.Параметры.Вставить("ТипОбращения", ТипОбращения);
	Запрос.Параметры.Вставить("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ИДКодаЗавершения = СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", "_");
		НоваяСтрока.ИмяКоманды = "КодЗавершения_" + ИДКодаЗавершения;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
